aws/amazon-freertos/lib/third_party/mcu_vendor/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx210/r_s12ad_rx210.c
    /* MARK DRIVER AS OPENED */
    g_dcb.opened = true;
    R_BSP_HardwareUnlock(BSP_LOCK_S12AD);

    return ADC_SUCCESS;
}


/******************************************************************************
* Function Name: adc_control
* Description  : This function provides commands for enabling channels and
*                sensors and for runtime operations. These include enabling/
*                disabling trigger sources and interrupts, initiating a
*                software trigger, and checking for scan completion.
*
* NOTE: Enabling a channel or a sensor, or setting the sample state count reg
*       cannot be done while the ADCSR.ADST bit is set (conversion in progress).
*       Because these commands should only be called once during initialization
*       before triggers are enabled, this should not be an issue. Registers
*       with this restriction include ADANSA, ADANSB, ADADS, ADADC, ADSSTR,
*       ADEXICR, and some bits in ADCSR and TSCR.
*       No runtime operational sequence checking of any kind is performed.
*
* Arguments    : unit -
*                    Ignored for rx210. Pass 0 for this argument.
*                cmd-
*                    Command to run
*                p_args-
*                    Pointer to optional configuration structure
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_MISSING_PTR-
*                    p_args pointer is FIT_NO_PTR/NULL when required as an argument
*                ADC_ERR_INVALID_ARG-
*                    cmd or element of p_args structure has invalid value.
*                ADC_ERR_ILLEGAL_CMD-
*                    cmd is illegal based upon mode
*                ADC_ERR_SCAN_NOT_DONE-
*                    The requested scan has not completed
*                ADC_ERR_UNKNOWN
*                    Did not receive expected hardware response
*******************************************************************************/
adc_err_t adc_control(uint8_t const       unit,
                      adc_cmd_t const     cmd,
                      void * const        p_args)
{
adc_err_t       err=ADC_SUCCESS;
adc_time_t      *p_sample;
adc_dda_t   *charge;


    switch (cmd)
    {
    case ADC_CMD_SET_DDA_STATE_CNT:
        charge = (adc_dda_t *) p_args;
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
        if ((g_dcb.mode == ADC_MODE_SS_TEMPERATURE)
         || (g_dcb.mode == ADC_MODE_SS_INT_REF_VOLT))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
        if (charge->method != ADC_DDA_OFF)
        {
            if ((charge->num_states == 0) || (charge->num_states > ADC_DDA_STATE_CNT_MAX))
            {
                return ADC_ERR_INVALID_ARG;
            }
        }
#endif
        if (charge->method == ADC_DDA_OFF)
        {
            S12AD.ADDISCR.BYTE = 0;
        }
        else
        {
            // NOTE: Using Disconnect Detection Assist adds num_states x (#chans) ADCLKS to scan time
            S12AD.ADDISCR.BYTE = (uint8_t)((charge->method == ADC_DDA_PRECHARGE) ? 0x10 : 0);
            S12AD.ADDISCR.BYTE |= charge->num_states;
        }
    break;


    case ADC_CMD_SET_SAMPLE_STATE_CNT:
        p_sample = (adc_time_t *) p_args;
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
        if (p_sample->num_states < ADC_SST_CNT_MIN)
        {
            return ADC_ERR_INVALID_ARG;
        }
#endif
        *sreg_ptrs[p_sample->reg_id] = p_sample->num_states;
    break;


    case ADC_CMD_ENABLE_CHANS:
        err = adc_enable_chans((adc_ch_cfg_t *) p_args);
    break;


    case ADC_CMD_ENABLE_TEMP_SENSOR:
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
        if (g_dcb.mode != ADC_MODE_SS_TEMPERATURE)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
#endif
        // WARNING! Cannot use 50MHz PCLKD here. Must be < 3.6Mhz. Want sampling time around 70us
        // (see HW Manual section 35.3.2 "Setting of 12-Bit A/D Converter")
        S12AD.ADEXICR.BIT.TSS = 1;                  // select temperature sensor

        S12AD.ADCSR.BIT.TRGE = 1;                   // enable trigger
        TEMPS.TSCR.BIT.PGAGAIN = ADC_CFG_PGA_GAIN;  // set gain
        TEMPS.TSCR.BIT.TSEN = 1;                    // enable temp sensor
                                                    // no temperature addition on RX210
        adc_enable_s12adi0();                       // setup interrupt handling

    break;


    case ADC_CMD_ENABLE_VOLT_SENSOR:
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
        if (g_dcb.mode != ADC_MODE_SS_INT_REF_VOLT)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
#endif
        S12AD.ADEXICR.BIT.OCS = 1;                  // select ref voltage sensor
        if (S12AD.ADADC.BIT.ADC != ADC_ADD_OFF)
        {
            S12AD.ADEXICR.BIT.OCSAD = 1;            // enable addition
        }
        adc_enable_s12adi0();                       // setup interrupt handling
    break;


    case ADC_CMD_ENABLE_TRIG:
        S12AD.ADCSR.BIT.TRGE = 1;           // enable sync/async triggers
    break;


    case ADC_CMD_DISABLE_TRIG:
        S12AD.ADCSR.BIT.TRGE = 0;           // disable sync/async triggers
    break;


    case ADC_CMD_SCAN_NOW:
        /* For all parts, set the ADST bit to start a software scan EXCEPT
         * for the temperature sensor on the RX210. There use PGAEN to trigger
         * a conversion.
         */
        if (g_dcb.mode == ADC_MODE_SS_TEMPERATURE)
        {
            if (TEMPS.TSCR.BIT.PGAEN == 0)
            {
                TEMPS.TSCR.BIT.PGAEN = 1;
            }
            else
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
        }
        else
        {
            if (S12AD.ADCSR.BIT.ADST == 0)
            {
                S12AD.ADCSR.BIT.ADST = 1;
            }
            else
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
        }
    break;


    case ADC_CMD_CHECK_SCAN_DONE:           // default/Group A or Group B
        if (g_dcb.mode == ADC_MODE_SS_TEMPERATURE)
        {
           if (TEMPS.TSCR.BIT.PGAEN == 1)
           {
               err = ADC_ERR_SCAN_NOT_DONE;
           }
        }
        else
        {
            if (S12AD.ADCSR.BIT.ADST == 1)
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
        }
    break;


    case ADC_CMD_CHECK_SCAN_DONE_GROUPA:
        if (ICU.IR[IR_S12AD_S12ADI0].BIT.IR == 1)
        {
            ICU.IR[IR_S12AD_S12ADI0].BIT.IR = 0;
        }
        else
        {
            err = ADC_ERR_SCAN_NOT_DONE;
        }
    break;


    case ADC_CMD_CHECK_SCAN_DONE_GROUPB:
        if (ICU.IR[IR_S12AD_GBADI].BIT.IR == 1)
        {
            ICU.IR[IR_S12AD_GBADI].BIT.IR = 0;
        }
        else
        {
            err = ADC_ERR_SCAN_NOT_DONE;
        }
    break;


    case ADC_CMD_ENABLE_INT:
        S12AD.ADCSR.BIT.ADIE = 1;           // enable S12ADI0 interrupt
    break;


    case ADC_CMD_DISABLE_INT:
        S12AD.ADCSR.BIT.ADIE = 0;           // disable S12ADI0 interrupt
    break;


    case ADC_CMD_ENABLE_INT_GROUPB:
        S12AD.ADCSR.BIT.GBADIE = 1;         // enable GBADI interrupt
    break;


    case ADC_CMD_DISABLE_INT_GROUPB:
        S12AD.ADCSR.BIT.GBADIE = 0;         // disable GBADI interrupt
    break;


    default:
        err = ADC_ERR_INVALID_ARG;
    break;
    }

