aws/amazon-freertos/lib/third_party/mcu_vendor/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx210/r_s12ad_rx210.c
    return err;
}


/******************************************************************************
* Function Name: adc_enable_chans
* Description  : This function does extensive checking on channel mask
*                settings based upon operational mode. Mask registers are
*                initialized and interrupts enabled in peripheral. Interrupts
*                are also enabled in ICU if corresponding priority is not 0.
*
* NOTE: A negative number is stored in two's complement form.
*       A quick way to change a binary number into two's complement is to
*       start at the right (LSB) and moving left, don't change any bits
*       until after the first "1" is reached.
*       Number          2's complement
*       0010 0110       1101 1010
*       0000 0001       1111 1111
*       Another way is to do a 1's complement on the number, then add 1 to that.
*       Number          1's complement  + 1
*       0010 0110       1101 1001       1101 1010
*       0000 0001       1111 1110       1111 1111
*
* Arguments    : p_config
*                    Pointer to channel config structure containing masks
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    reg_id contains an invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon mode
*******************************************************************************/
static adc_err_t adc_enable_chans(adc_ch_cfg_t *p_config)
{
uint16_t    i=0;
uint32_t    tmp_mask=0;


#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    uint32_t    a_mask,b_mask;

    /* This command is illegal for sensor modes */
    if ((g_dcb.mode == ADC_MODE_SS_TEMPERATURE)
     || (g_dcb.mode == ADC_MODE_SS_INT_REF_VOLT))
    {
        return ADC_ERR_ILLEGAL_ARG;
    }

    /* Verify at least one bonded channel is selected */
    if ((p_config->chan_mask == 0)
     || ((p_config->chan_mask & ADC_INVALID_CH_MASK) != 0))
    {
        return ADC_ERR_INVALID_ARG;
    }

    /* Verify at least one unique bonded channel is selected for Group B */
    if (S12AD.ADCSR.BIT.ADCS == ADC_ADCS_GROUP_SCAN)
    {
        if ((p_config->chan_mask_groupb == 0)
         || ((p_config->chan_mask_groupb & ADC_INVALID_CH_MASK) != 0))
        {
            return ADC_ERR_INVALID_ARG;
        }
        else if ((p_config->chan_mask & p_config->chan_mask_groupb) != 0)
        {
            return ADC_ERR_ILLEGAL_ARG;         // same chan in both groups
        }
        else
        {
            tmp_mask = p_config->chan_mask_groupb;
        }
    }
    else
    {
        p_config->chan_mask_groupb = 0;         // for addition mask checking
    }

    /* Addition mask should not include bits from inactive channels */
    if (S12AD.ADADC.BIT.ADC != ADC_ADD_OFF)
    {
        tmp_mask |= p_config->chan_mask;        // tmp_mask is Group A and B combined
        // Bit-AND with 1s-complement
        if ((p_config->add_mask & ~tmp_mask) != 0)
        {
            return ADC_ERR_INVALID_ARG;
        }
    }
    else
    {
        // WARNING! Other features messed up if add_mask is non-zero when addition is turned off!
        p_config->add_mask = 0;
    }

    /* Verify only 1 bit is set in default/Group A mask */
    if ((g_dcb.mode == ADC_MODE_SS_ONE_CH)
     || (g_dcb.mode == ADC_MODE_CONT_ONE_CH)
     || (S12AD.ADCSR.BIT.DBLE == 1))        // double trigger mode
    {
        tmp_mask = p_config->chan_mask;     // tmp_mask is non-Group/Group A chans
        // Bit-AND with 2s-complement (see note in function header)
        if ((tmp_mask & (~tmp_mask + 1)) != tmp_mask)
        {
            return ADC_ERR_INVALID_ARG;
        }
    }

    if (p_config->sample_hold_mask != 0)
    {
        /* S&H chans can only be 0,1,2 and must have at least minimum state count specified */
        if ((p_config->sample_hold_mask > 0x7)
         || (p_config->sample_hold_states < ADC_SST_SH_CNT_MIN))
        {
            return ADC_ERR_INVALID_ARG;
        }
    }

    /* Don't work self-diag with single scan mode(double trigger) or group scan mode(double trigger) */
    if (p_config->diag_method != ADC_DIAG_OFF)
    {
        if ((g_dcb.mode == ADC_MODE_SS_ONE_CH_DBLTRIG)
         || (g_dcb.mode == ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }
#endif // parameter checking


    /* SET MASKS FOR ALL CHANNELS */

    S12AD.ADANSA.WORD = (uint16_t) (p_config->chan_mask & 0xFFFF);
    S12AD.ADANSB.WORD = (uint16_t) (p_config->chan_mask_groupb & 0xFFFF);
    S12AD.ADADS.WORD = (uint16_t) (p_config->add_mask & 0xFFFF);


    // NOTE: S&H adds to scan time because normal state machine still runs.
    // adds 10 + sample_hold_states ADCLKS to scan time
    S12AD.ADSHCR.BIT.SHANS = p_config->sample_hold_mask;
    S12AD.ADSHCR.BIT.SSTSH = p_config->sample_hold_states;


    /* SET SELF DIAGNOSIS REGISTERS (VIRTUAL CHANNEL) */

    if (p_config->diag_method == ADC_DIAG_OFF)
    {
        S12AD.ADCER.BIT.DIAGM = 0;
    }
    else
    {
        // NOTE: Using Self Diagnosis adds 30+(ch0 SST) ADCLKS to scan time.
        // (ch0 can still be used with self diagnosis on)
        if (p_config->diag_method == ADC_DIAG_ROTATE_VOLTS)
        {
            S12AD.ADCER.BIT.DIAGLD = 0;
            S12AD.ADCER.BIT.DIAGVAL = 1;
        }
        else
        {
            S12AD.ADCER.BIT.DIAGLD = 1;
            S12AD.ADCER.BIT.DIAGVAL = (uint8_t)(p_config->diag_method & 0x3);   // 2-bit value;
        }
        S12AD.ADCER.BIT.DIAGM = 1;
    }


    /* SET DOUBLE TRIGGER CHANNEL */

    if (S12AD.ADCSR.BIT.DBLE == 1)
    {
        tmp_mask = p_config->chan_mask;     // tmp_mask is non-Group/Group A chans
        while (tmp_mask >>= 1)              // determine bit/ch number
        {
            i++;
        }
        S12AD.ADCSR.BIT.DBLANS = i;
    }


    /* ENABLE INTERRUPTS */

    adc_enable_s12adi0();
    if (S12AD.ADCSR.BIT.ADCS == ADC_ADCS_GROUP_SCAN)
    {
        IR(S12AD,GBADI) = 0;                // clear flag
        S12AD.ADCSR.BIT.GBADIE = 1;         // enable in peripheral
        if (ICU.IPR[IPR_S12AD_GBADI].BYTE != 0)
        {
            IEN(S12AD,GBADI) = 1;           // enable in ICU
        }
    }

    return ADC_SUCCESS;
}

#endif
